app/controllers/api/v1/weathers_controller.rb

  def index
    local = params[:local]

    if (local.to_s.empty?)
      render json: 'Not found', status: 404
    else
      params = {:query => local, :access_key => "f613d33c4f74fc5b648685dc3428d345"}
      conn = Faraday.get("http://api.weatherstack.com/current", params) do |req|
---
SELECT "weathers".* FROM "weathers" ORDER BY "weathers"."id" ASC LIMIT ?  [["LIMIT", 1]]